title: DHCP Discover Event
name: dhcp_discover_event
status: experimental
description: Detects DHCP Discover packets
logsource:
    category: network_connection
    product: linux
    service: dhcpd
detection:
    selection:
        protocol: 'DHCP'
        messageType_name: DISCOVER
    condition: selection
tags:
  - detection.only