title: ARP Network Scanning
name: arp_event
description: Detects ARP requests
status: experimental
logsource:
    category: network_connection
    product: linux
    service: network
detection:
    selection:
        protocol: 'ARP'
        arp.opcode: request
    condition: selection
tags:
  - detection.only

