title: DHCP Starvation Attack detected
status: experimental
correlation:
    type: event_count
    rules:
     - dhcp_discover_packets
    group-by:
      - mac_address
    timespan: 1m
    condition:
      gte: 100

---

title: DHCP Discover Event
name: dhcp_discover_packets
status: experimental
description: Detects DHCP Discover packets
logsource:
    category: network_connection
    product: linux
    service: dhcpd
detection:
    selection:
        protocol: 'DHCP'
        messageType_name: DISCOVER
    condition: selection

